Revit 2027 API
AdaptiveComponentInstanceUtils.GetInstancePlacementPointElementRefIds Method
 Gets Placement Adaptive Point Element Ref ids to which the instance geometry adapts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> GetInstancePlacementPointElementRefIds(
	FamilyInstance famInst
)
Public Shared Function GetInstancePlacementPointElementRefIds (
	famInst As FamilyInstance
) As IList(Of ElementId)
public:
static IList<ElementId^>^ GetInstancePlacementPointElementRefIds(
	FamilyInstance^ famInst
)
static member GetInstancePlacementPointElementRefIds :
        famInst : FamilyInstance -> IList<ElementId>
Parameters
famInst FamilyInstance
 The FamilyInstance.
Return Value
IList<ElementId>
 The Placement Adaptive Point Element Ref ids to which the instance geometry adapts.
Exceptions
Exception | Condition
ArgumentException |  The FamilyInstance famInst is not an Adaptive Family Instance. -or- The FamilyInstance famInst does not have an Adaptive Family Symbol.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This operation failed.
Remarks
 The output contains placement point ref ids. The element ids are sorted in by the placement numbers (increasing order).
See Also
Reference
AdaptiveComponentInstanceUtils Class
Autodesk.Revit.DB Namespace